
def area(a):
    '''Возвращает площадь квадрата с заданной стороной a.
        Параметры:
                a (float): сторона квадрата
        
        Возвращаемое значение:
                area(a) (float): площадь квадрата с заданной стороной a'''
    return a * a


def perimeter(a):
    '''Возвращает периметр квадрата с заданной стороной a.
        Параметры:
                a (float): сторона квадрата
        
        Возвращаемое значение:
                perimeter(a) (float): периметр квадрата с заданной стороной a'''
    return 4 * a
